Show / Hide Table of Contents
Class Settlement
Settlement of point support
Inheritance
System.Object
OpenObject
OpenElementId
Settlement
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Loading.Settlement,CI.Loading", "CI.StructModel.Loading.ISettlement,CI.BasicTypes")]
public class Settlement : OpenElementId
Examples
This sample shows how to create a .
//Creating the model
OpenModel openModel = new OpenModel();
//Create nodes
Point3D pointA = new Point3D();
pointA.X = 0;
pointA.Y = 0;
pointA.Z = 0;
openModel.AddObject(pointA);
Point3D pointB = new Point3D();
pointB.X = 0;
pointB.Y = 0;
pointB.Z = 1.2;
openModel.AddObject(pointB);
Point3D pointC = new Point3D();
pointC.X = 0;
pointC.Y = 0;
pointC.Z = 2.4;
openModel.AddObject(pointC);
//Line between nodes
LineSegment3D line1 = new LineSegment3D();
line1.StartPoint = new ReferenceElement(pointA);
line1.EndPoint = new ReferenceElement(pointB);
//LCS of line
line1.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line1);
//Line between nodes
LineSegment3D line2 = new LineSegment3D();
line2.StartPoint = new ReferenceElement(pointB);
line2.EndPoint = new ReferenceElement(pointC);
//LCS of line
line2.LocalCoordinateSystem = new CoordSystemByZup();
openModel.AddObject(line2);
//Point support in the bottom node
PointSupportNode pointSupportA = new PointSupportNode();
pointSupportA.Point = new ReferenceElement(pointA);
pointSupportA.SupportTypeRX = SupportTypeInDirrection.Free;
pointSupportA.SupportTypeRY = SupportTypeInDirrection.Free;
pointSupportA.SupportTypeRZ = SupportTypeInDirrection.Rigid;
pointSupportA.SupportTypeX = SupportTypeInDirrection.Rigid;
pointSupportA.SupportTypeY = SupportTypeInDirrection.Rigid;
pointSupportA.SupportTypeZ = SupportTypeInDirrection.Rigid;
openModel.AddObject(pointSupportA);
//Point support in the top node
PointSupportNode pointSupportB = new PointSupportNode();
pointSupportB.Point = new ReferenceElement(pointC);
pointSupportB.SupportTypeRX = SupportTypeInDirrection.Free;
pointSupportB.SupportTypeRY = SupportTypeInDirrection.Free;
pointSupportB.SupportTypeRZ = SupportTypeInDirrection.Free;
pointSupportB.SupportTypeX = SupportTypeInDirrection.Rigid;
pointSupportB.SupportTypeY = SupportTypeInDirrection.Rigid;
pointSupportB.SupportTypeZ = SupportTypeInDirrection.Free;
openModel.AddObject(pointSupportB);
//Load case
LoadCase loadCase = new LoadCase();
//...
openModel.AddObject(loadCase);
//Setlement on the Support A - 1mm in global Z - direction
var settl = new Settlement();
settl.ValueX = 0.0;
settl.ValueY = 0.0;
settl.ValueZ = -0.001;
settl.ValueRx = 0.0;
settl.ValueRy = 0.0;
settl.ValueRz = 0.0;
settl.Support = new ReferenceElement(pointSupportA);
openModel.AddObject(settl);
loadCase.Settlements.Add(new ReferenceElement(settl));
Constructors
Improve this Doc   View Source
Settlement()
Constructor
Declaration
public Settlement()
Properties
Improve this Doc   View Source
Support
Support with settlement
Declaration
public ReferenceElement Support { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
ValueRx
Rotation around X-axis
Declaration
public double ValueRx { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ValueRy
Rotation around Y-axis
Declaration
public double ValueRy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ValueRz
Rotation around Z-axis
Declaration
public double ValueRz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ValueX
Settlement in X dirrection of support
Declaration
public double ValueX { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ValueY
Settlement in Y dirrection of support
Declaration
public double ValueY { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ValueZ
Settlement in Z dirrection of support
Declaration
public double ValueZ { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source